// massic3(10).cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <math.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "RUS");

    bool flag = true;
    int sum = 0;
    const int n{ 9 }; //длина
    int arr[n]; //сам массив

    int i{}; //счетчик
    cout << "Введите значения элементов массива: ";

    //заполнение массива
    while (i < n) {
        cin >> arr[i];
        i++;
    }
    //
    // вывод массива
   
    cout << "Номера элементов (если таковые имеются): ";
    for (i = 0; i < n; ++i) {
        if (arr[i] % 2 == 1 && arr[i] % 3 && i > 0) { // нечентые числа и не кратные трем
            cout << i << " ";
            flag = false;
            if (flag) {
                cout << "Таких элементов нет";
            }
        }
       
      
    }
    system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
