fun f3 ((n: int, r: real, ints: int list), pairs: (int * real) list) =
    let
        val (a, b) = hd pairs
        val nPlus5 = n + 5
        val aPlusBPlus7 = a + Real.round(b) + 7
    in
        real(nPlus5) * real(aPlusBPlus7)
    end

(* Тесты *)

(* Результат: 132.0 *)
val test0 = f3 ( (7, 9.3, [6, 0, 3, 2, 4])
               , [(3, 1.1), (6, 0.0), (7, 3.2), (10, 1.8)]
               )

(* Результат: 77.0 *)
val test1 = f3 ( (2, 70.3, [6, 1, 3, 2, 4])
               , [(3, 1.1), (6, 0.0), (7, 3.2), (10, 1.8)] 
               )

(* Результат: 176.0 *)
val test2 = f3 ( (11, 9.3, [1, 0, 3, 2, 4])
               , [(3, 1.1), (6, 1.0), (7, 3.2), (10, 1.8)]
               )

(* Результат: 143.0 *)
val test3 = f3 ( (8, 9.7, [6, 1, 3, 2, 4])
               , [(3, 1.1), (9, 1.0), (7, 3.2), (200, 1.8)] 
               )





