// number1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>

using namespace std; 
 // Вариант первого задания 2

int main()
{

	float x, y, digit; // переменные

	

	cout << "Input x: "; // Введите х
	cin >> x; // Введение у

	cout << "Input y: "; // Введите у
	cin >> y; // Введение у

	digit = (1 / 5 * x * y + (sqrt(exp( x - 1)) + (exp( y - 1) / pow(cos(x), 2) * x + 2 * y)));

	cout << "Output: " << digit; // Вывод


}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
